/*Відомий програміст Петро планує створити абсолютно нову захоплюючу
комп’ютерну гру, яка не марилася жодній провідній фірмі по розробці ігор.
Петро впевнений, що завдяки тим революційним особливостям, які він
збирається реалізувати, його гра швидко захопить ринок та принесе йому
всесвітню славу та величезні прибутки. Однією з таких особливостей буде
система відображення результатів у таблиці рекордів. Кожен результат – це
число, що записано у десятковій системі. Але цифри та знак мінус будуть
відображуватися за допомогою декількох ліній:
Допоможіть Петру визначити, скільки ліній намалює його програма, коли
гравець набере визначену кількість очок.*/


#include <iostream>
#include <cmath>
using namespace std;

int cnt_lines(int num)
{
    int dig, cnt;
    int mas[10]={6, 2, 5, 5, 4, 5, 6, 3, 7, 6};
    cnt=0;

    if (num<0) cnt++; 
    num = abs(num); 
    
    if (num==0) cnt=6;
 
    while (num != 0)
    {
        dig=num % 10;
        cnt=cnt+mas[dig];
        num = num / 10;
    }

    return cnt;
}


int main()
{
    int N;
    cin >> N;
    cout << cnt_lines(N);
    return 0;
}