/*Хлопчик Антон хоче побудувати пірамідку з
кубиків. Пірамідка має виглядати так:
перший «поверх» – квадрат 𝑘 × 𝑘 кубиків,
другий – квадрат (𝑘 − 1) × (𝑘 − 1), і так далі,
всього 𝑘 поверхів, на останньому 1 кубик.
Всього у Антона є 𝑁 кубиків, і він хоче
побудувати з них якомога більш високу
пірамідку (при цьому можливо деякі з його
кубиків не будуть задіяні). Допоможіть йому визначити
максимальний можливий розмір пірамідки (максимальне
можливе 𝑘).*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

int main()
{
    long long num, cnt, N;
    cin >> num;
    N=0;
    cnt=0;
    for (int i = 1; N <= num; i++)
    {
       N=N+pow(i, 2);
       cnt++; 
    }

    cnt--;
    cout << cnt;
    return 0;
}